In [4]:
import pandas as pd

In [5]:
## using kaggle dataset
df = pd.read_csv("globalAirQuality.csv")
df

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.min()

In [ ]:
df.max()

In [ ]:
df.nunique()

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
## selecting data from kaggle dataset -->>
## 1. Column wise seelction --> data_name["column_name/label"]

data1 = df["aqi"]
print(data1)
## for multiple columns --> pass the list of column names -> data_name[["column_names/labels"]]
data2 = df[["country","city","aqi"]]
data2

## Filtering Data using rows & columns on some condition

In [ ]:
## filtering data -->>
## Method 1
data =  df["aqi"]
data
df[data > 100]

In [ ]:
## Method 2
df[df["aqi"] > 100]

In [ ]:
aqi_data= df["aqi"]
temp_data = df["temperature"]

data = df[(aqi_data > 100) & (temp_data > 30)][["city","aqi"]]
data
data.iloc[0]
# data.loc[6]

## Filtering Data using query() method :

In [ ]:
## filtering data using query() method -->>
df.query("aqi > 100")
aqi_value = 100
temp_value = 30
df.query("aqi > @aqi_value & temperature > @temp_value")[["city","aqi"]]

## Handling Missing Values With Pandas

In [38]:
## Handling Missing Values using Pandas -->>
df = pd.read_csv("raw_data.csv")
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [39]:
## df.isnull() --> prints the data in table form and wherever the data is NaN, NaN appear as True and non null data appears as false
df.isnull() ## df.isna() similar to isnull()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [40]:
## finding number of null/missing values for per/each culumns -->>
df.isnull().sum()

id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64

In [41]:
## To drop all the null/missing vlues from the dataset -->> df.dropna() -> drops the null values and print data with no null values
## if any row as null values then df.dropna() drops the complete row.
df.dropna()  ## drops rows
df.dropna(axis = 1)  ## drops columns with null/missing values

    id
0    1
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10

In [42]:
## filling null values  with any other value -->>

## filling the missing/null age with mean of the age -->>
age_mean = df["age"].mean()
print(age_mean)

# cleaned_data = df.copy()
# cleaned_data["age"] = cleaned_data["age"].fillna(age_mean)
# cleaned_data

32.75

In [43]:
## filling the missing/null name with xyz -->>
# cleaned_data["name"] = cleaned_data["name"].fillna("xyz")
# cleaned_data

In [44]:
df.ffill()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  29.0  Canada   Female  62000.0
3    3          Alex  29.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  47000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6        Li Wei  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0   India     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  29.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA     Male  58000.0

In [45]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [47]:
df.ffill()  ## if we look from top to bottom if any NaN values exist then last valid ecountered value will be filled in place of NaN

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  29.0  Canada   Female  62000.0
3    3          Alex  29.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  47000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6        Li Wei  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0   India     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  29.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA     Male  58000.0

In [50]:
## backward filling -->> vece-versa of forward filling
## if the bottom most cell is NaN it will be as it is
df.bfill()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

## Handling Duplicate Values with Pandas :

In [63]:
## to find the duplicated values - use .duplicated() method
duplicate_data = df.duplicated()
print(duplicate_data)

## True value in the output shows that the entire row at the corresponfing label is duplicated.

## we can check duplicate for combination of rows or columns 
df[["country","name"]].duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [75]:
## to delete duplicates we use .drop_duplicates() method
df.drop_duplicates() ## change does not reflect in the original data

## if we wanted to reflect the changes made in the original data then pass an attribute - "inplace =True" in the drop_duplicates() methohd
df.drop_duplicates(inplace=True)
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

## Handling Different Data Types

In [86]:
## Data Types -->>
##
df.dtypes   ## print data types of each column

## changing the dtpe of any column
df2 = df.copy()
df2 = df2.fillna(0)
df2["age"] = df2["age"].astype("int64").copy()
df2.dtypes

id           int64
name        object
age          int64
country     object
gender      object
income     float64
dtype: object

In [88]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

## Normal Date to DateTime Stamp

In [92]:
date_str =pd.Series([ "2025-12-31"])
print(type(date_str.dtype))

<class 'numpy.dtypes.ObjectDType'>

In [99]:
date_to_time = pd.to_datetime(date_str)
type(date_to_time.dtype)

numpy.dtypes.DateTime64DType

## Handling Strings In Pandas

In [114]:
## converting lower case to upper
df["gender"].str.lower()
## converting upper case to lower
df["gender"].str.upper()

## capitalize the first letter 
df["gender"].str.capitalize()

## split on basis of space(" ")
df["name"].str.split(" ")

## we can also pass seperator in the split() method -->>
## if we want to split at @ then we can pass @ as str.split("@")

## checking if a column contains any perticular value or not -->>
df["country"].str.contains("US") ## passed parameter is case senstive

## if we want the check irrrespective of case
df["country"].str.contains("india", case=False)

0     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object